tap "cmacrae/formulae"
tap "epk/epk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "planetscale/tap"
tap "qmk/qmk"
tap "shivammathur/php"
tap "strongdm/comply"
brew "bat"
brew "black"
brew "exa"
brew "fd"
brew "fzf"
brew "git"
brew "go"
brew "lazygit"
brew "lua-language-server"
brew "luarocks"
brew "neovim"
brew "perl"
brew "php", link: false
brew "putty"
brew "ripgrep"
brew "stow"
brew "stylua"
brew "tldr"
brew "tmux"
brew "tree"
brew "wget"
brew "zoxide"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "planetscale/tap/pscale"
brew "shivammathur/php/php@7.3", link: true
cask "alacritty"
cask "font-sf-mono-nerd-font"
