brew "fd"
brew "exa"
brew "fzf"
brew "go"
brew "lazygit"
brew "lua-language-server"
brew "luarocks"
brew "neovim"
brew "perl"
brew "ripgrep"
brew "stow"
brew "stylua"
brew "tmux"
brew "zoxide"
cask "alacritty"
cask "nerd-font"
tap "strongdm/comply"


NeoVim Plugins:
  use("windwp/nvim-autopairs") -- Autopairs, integrates with both cmp and treesitter
	use("wbthomason/packer.nvim") -- Have packer manage itself
	use("nvim-lua/plenary.nvim") -- Useful lua functions used by lots of plugins
	use("numToStr/Comment.nvim")
	use("JoosepAlviste/nvim-ts-context-commentstring")
	use("kyazdani42/nvim-web-devicons")
	use("kyazdani42/nvim-tree.lua")
	use("akinsho/bufferline.nvim")
	use("moll/vim-bbye")
	use("nvim-lualine/lualine.nvim")
	use("akinsho/toggleterm.nvim")
	use("ahmedkhalf/project.nvim")
	use("lewis6991/impatient.nvim")
	use("lukas-reineke/indent-blankline.nvim")
	use("goolord/alpha-nvim")
	use("folke/which-key.nvim")

	-- Colorschemes
	use("folke/tokyonight.nvim")

	-- completion plugins
	use("hrsh7th/nvim-cmp") -- The completion plugin
	use("hrsh7th/cmp-buffer") -- buffer completions
	use("hrsh7th/cmp-path") -- path completions
	use("saadparwaiz1/cmp_luasnip") -- snippet completions
	use("hrsh7th/cmp-nvim-lsp")
	use("hrsh7th/cmp-nvim-lua")

	-- snippets
	use("L3MON4D3/LuaSnip") --snippet engine
	use("rafamadriz/friendly-snippets") -- a bunch of snippets to use

	-- LSP
	use("neovim/nvim-lspconfig") -- enable LSP
	use("williamboman/nvim-lsp-installer") -- simple to use language server installer
	use("jose-elias-alvarez/null-ls.nvim") -- for formatters and linters

	-- Telescope
	use("nvim-telescope/telescope.nvim")

	-- Treesitter
  use("nvim-treesitter/nvim-treesitter")

	-- Git
	use("lewis6991/gitsigns.nvim")
  use("kdheepak/lazygit.nvim")

  use("gpanders/editorconfig.nvim")

